chapter1.org
* Getting started

- Awk is a convenient and expressive programming language that can be
  applied to a wide variety of computing and data-manipulation tasks.
- *emp.data* will be used to explore further

#+begin_src sh :exports both
bat emp.data
#+end_src

#+RESULTS:
| Beth  |  4.0 |  0 |
| Dan   | 3.75 |  0 |
| Kathy |  4.0 | 10 |
| Mark  |  5.0 | 20 |
| Mary  |  5.5 | 22 |
| Susie | 4.25 | 18 |

 - First column: Employee name
 - Second column: Pay rate in dollars per hour
 - Third column: Number of hours worked

** Employees who worked more than zero hours

#+begin_src awk :in-file emp.data :exports both
$3 > 0 { print $1, $2 * $3} 
#+end_src

#+RESULTS:
| Kathy |   40 |
| Mark  |  100 |
| Mary  |  121 |
| Susie | 76.5 |

Note that the above command in a CLI will be invoked like this:

#+begin_example sh
$ awk '$3 > 0 { print $1, $2 * $3}' emp.data
#+end_example

- But in this document we will just concentrate on it's language. The
  part inside the quotes is the complete awk program. It consists of a
  single *pattern action statement*.
- The pattern ~$3 > 0$~ matches every input line in which the third
  column or field is greater than zero and executes the corresponding
  action.

** Employees who didn't work

#+begin_src awk :in-file emp.data :exports both
$3 == 0 { print $1 }
#+end_src

#+RESULTS:
| Beth |
| Dan  |

* The Structure of an AWK Program

- Each awk program is a sequence of one or more pattern action
  statements:

#+begin_example
pattern { action }
pattern { action }
...
#+end_example

- The basic operation of awk is to scan a sequence of input lines one
  after another, searching for lines that are matched by any of the
  patterns in the program. The precise meaning of the word "match"
  depends on the pattern.
- Every input line is tested against each of the patterns in turn. For
  each pattern that matches, the corresponding action is performed.
- If the pattern has no action, then each line that the pattern
  matches is printed:

#+begin_src awk :in-file emp.data :exports both
$3 == 0
#+end_src

#+RESULTS:
| Beth |  4.0 | 0 |
| Dan  | 3.75 | 0 |

- If there is an action with no pattern, then for each line the action
  is performed:

#+begin_src awk :in-file emp.data :exports both
{ print $1 }
#+end_src

#+RESULTS:
| Beth  |
| Dan   |
| Kathy |
| Mark  |
| Mary  |
| Susie |

* Running an AWK Program

Several ways:

#+begin_src 
$ aws 'program' files
$ aws '$3 == 0 { print $1}' file1 file2
#+end_src

Or you can supply input via stdin:

#+begin_src 
$ awk 'program'
#+end_src

It accepts input till the end-of-file signal. (Ctrl-D on Unix). The
stdin way of doing will be quite handy to experiment. If your awk
program is long, you can pass the program explicitly:

#+begin_src 
$ awk -f progfile input files
#+end_src

* Errors

Awk will report an error if there is an error in the code
(duh!). Let's mistype a brace:

#+begin_src 
$ awk '$3 == 0 [ print $1 }' emp.dat
awk: line 1: syntax error at or near [
awk: line 1: extra '}'
#+end_src

* Simple output

- There are only two types of data in awk: numbers and string of
  characters.
- Awk reads its input one line at a time and splits each line into
  fields, where, by default, a field is a sequence of characters that
  doesn't contain any blanks or tabs. The first field in the current
  input line is called $1, the second $2, and so forth. The entire
  line is called $0. The number of fields can vary from line to line.

