docs/chapter1.html
<!doctype html>
<html lang="en">
<head>
<title></title>
<!-- 2020-11-24 Tue 20:07 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Sibi Prabakaran">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://psibi.in/awk/"> UP </a>
 |
 <a accesskey="H" href="https://psibi.in/"> HOME </a>
</div><div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. An AWK Tutorial</a></li>
<li><a href="#sec-2">2. Getting started</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. Employees who worked more than zero hours</a></li>
<li><a href="#sec-2-2">2.2. Employees who didn't work</a></li>
</ul>
</li>
<li><a href="#sec-3">3. The Structure of an AWK Program</a></li>
<li><a href="#sec-4">4. Running an AWK Program</a></li>
<li><a href="#sec-5">5. Errors</a></li>
<li><a href="#sec-6">6. Simple output</a>
<ul class="nav">
<li><a href="#sec-6-1">6.1. Printing Every line</a></li>
<li><a href="#sec-6-2">6.2. Printing Certain Fields</a></li>
<li><a href="#sec-6-3">6.3. NF, the Number of Fields</a></li>
<li><a href="#sec-6-4">6.4. Computing and Printing</a></li>
<li><a href="#sec-6-5">6.5. Printing Line Numbers</a></li>
<li><a href="#sec-6-6">6.6. Printing Text in the Output</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Fancier Output</a>
<ul class="nav">
<li><a href="#sec-7-1">7.1. Lining up Fields</a></li>
<li><a href="#sec-7-2">7.2. Sorting the Output</a></li>
</ul>
</li>
<li><a href="#sec-8">8. Selection</a>
<ul class="nav">
<li><a href="#sec-8-1">8.1. Selection by Comparison</a></li>
<li><a href="#sec-8-2">8.2. Selection by Computation</a></li>
<li><a href="#sec-8-3">8.3. Selection by Text Content</a></li>
<li><a href="#sec-8-4">8.4. Combinations of Patterns</a></li>
<li><a href="#sec-8-5">8.5. Data validation</a></li>
<li><a href="#sec-8-6">8.6. BEGIN and END</a></li>
</ul>
</li>
<li><a href="#sec-9">9. Computing with AWK</a>
<ul class="nav">
<li><a href="#sec-9-1">9.1. Computing Sums and Averages</a></li>
<li><a href="#sec-9-2">9.2. Handling Text</a></li>
<li><a href="#sec-9-3">9.3. String Concatenation</a></li>
<li><a href="#sec-9-4">9.4. Printing the Last Input Line</a></li>
<li><a href="#sec-9-5">9.5. Built-in functions</a></li>
<li><a href="#sec-9-6">9.6. Counting Lines, Words and Characters</a></li>
</ul>
</li>
<li><a href="#sec-10">10. Control-Flow Statements</a>
<ul class="nav">
<li><a href="#sec-10-1">10.1. If-Else Statement</a></li>
<li><a href="#sec-10-2">10.2. While Statement</a></li>
<li><a href="#sec-10-3">10.3. For Statement</a></li>
</ul>
</li>
<li><a href="#sec-11">11. Arrays</a></li>
<li><a href="#sec-12">12. A Handful of Useful "One-liners"</a></li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title"></h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> An AWK Tutorial</h2>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Getting started</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Awk is a convenient and expressive programming language that can be
applied to a wide variety of computing and data-manipulation tasks.
</li>
<li><b>emp.data</b> will be used to explore further
</li>
</ul>

<div class="org-src-container">

<pre class="src src-sh">bat emp.data
</pre>
</div>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="right">

<col  class="right">
</colgroup>
<tbody>
<tr>
<td class="text-left">Beth</td>
<td class="text-right">4.0</td>
<td class="text-right">0</td>
</tr>

<tr>
<td class="text-left">Dan</td>
<td class="text-right">3.75</td>
<td class="text-right">0</td>
</tr>

<tr>
<td class="text-left">Kathy</td>
<td class="text-right">4.0</td>
<td class="text-right">10</td>
</tr>

<tr>
<td class="text-left">Mark</td>
<td class="text-right">5.0</td>
<td class="text-right">20</td>
</tr>

<tr>
<td class="text-left">Mary</td>
<td class="text-right">5.5</td>
<td class="text-right">22</td>
</tr>

<tr>
<td class="text-left">Susie</td>
<td class="text-right">4.25</td>
<td class="text-right">18</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>First column: Employee name
</li>
<li>Second column: Pay rate in dollars per hour
</li>
<li>Third column: Number of hours worked
</li>
</ul>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Employees who worked more than zero hours</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-awk">$3 &gt; 0 { print $1, $2 * $3} 
</pre>
</div>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="right">
</colgroup>
<tbody>
<tr>
<td class="text-left">Kathy</td>
<td class="text-right">40</td>
</tr>

<tr>
<td class="text-left">Mark</td>
<td class="text-right">100</td>
</tr>

<tr>
<td class="text-left">Mary</td>
<td class="text-right">121</td>
</tr>

<tr>
<td class="text-left">Susie</td>
<td class="text-right">76.5</td>
</tr>
</tbody>
</table>

<p>
Note that the above command in a CLI will be invoked like this:
</p>

<pre class="example">
$ awk '$3 &gt; 0 { print $1, $2 * $3}' emp.data
</pre>

<ul class="org-ul">
<li>But in this document we will just concentrate on it's language. The
part inside the quotes is the complete awk program. It consists of a
single <b>pattern action statement</b>.
</li>
<li>The pattern <code>$3 &gt; 0$</code> matches every input line in which the third
column or field is greater than zero and executes the corresponding
action.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Employees who didn't work</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-awk">$3 == 0 { print $1 }
</pre>
</div>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="text-left">Beth</td>
</tr>

<tr>
<td class="text-left">Dan</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> The Structure of an AWK Program</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Each awk program is a sequence of one or more pattern action
statements:
</li>
</ul>

<pre class="example">
pattern { action }
pattern { action }
...
</pre>

<ul class="org-ul">
<li>The basic operation of awk is to scan a sequence of input lines one
after another, searching for lines that are matched by any of the
patterns in the program. The precise meaning of the word "match"
depends on the pattern.
</li>
<li>Every input line is tested against each of the patterns in turn. For
each pattern that matches, the corresponding action is performed.
</li>
<li>If the pattern has no action, then each line that the pattern
matches is printed:
</li>
</ul>

<div class="org-src-container">

<pre class="src src-awk">$3 == 0
</pre>
</div>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="right">

<col  class="right">
</colgroup>
<tbody>
<tr>
<td class="text-left">Beth</td>
<td class="text-right">4.0</td>
<td class="text-right">0</td>
</tr>

<tr>
<td class="text-left">Dan</td>
<td class="text-right">3.75</td>
<td class="text-right">0</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>If there is an action with no pattern, then for each line the action
is performed:
</li>
</ul>

<div class="org-src-container">

<pre class="src src-awk">{ print $1 }
</pre>
</div>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="text-left">Beth</td>
</tr>

<tr>
<td class="text-left">Dan</td>
</tr>

<tr>
<td class="text-left">Kathy</td>
</tr>

<tr>
<td class="text-left">Mark</td>
</tr>

<tr>
<td class="text-left">Mary</td>
</tr>

<tr>
<td class="text-left">Susie</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Running an AWK Program</h2>
<div class="outline-text-2" id="text-4">
<p>
Several ways:
</p>

<pre class="example">
$ aws 'program' files
$ aws '$3 == 0 { print $1}' file1 file2
</pre>

<p>
Or you can supply input via stdin:
</p>

<pre class="example">
$ awk 'program'
</pre>

<p>
It accepts input till the end-of-file signal. (Ctrl-D on Unix). The
stdin way of doing will be quite handy to experiment. If your awk
program is long, you can pass the program explicitly:
</p>

<pre class="example">
$ awk -f progfile input files
</pre>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Errors</h2>
<div class="outline-text-2" id="text-5">
<p>
Awk will report an error if there is an error in the code
(duh!). Let's mistype a brace:
</p>

<pre class="example">
$ awk '$3 == 0 [ print $1 }' emp.dat
awk: line 1: syntax error at or near [
awk: line 1: extra '}'
</pre>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Simple output</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>There are only two types of data in awk: numbers and string of
characters.
</li>
<li>Awk reads its input one line at a time and splits each line into
fields, where, by default, a field is a sequence of characters that
doesn't contain any blanks or tabs. The first field in the current
input line is called $1, the second $2, and so forth. The entire
line is called $0. The number of fields can vary from line to line.
</li>
</ul>
</div>
