chapter1.org
** Printing Every line

#+begin_src awk :in-file emp.data :exports both
{ print }
#+end_src

#+RESULTS:
| Beth  |  4.0 |  0 |
| Dan   | 3.75 |  0 |
| Kathy |  4.0 | 10 |
| Mark  |  5.0 | 20 |
| Mary  |  5.5 | 22 |
| Susie | 4.25 | 18 |

Or even this:

#+begin_src awk :in-file emp.data :exports both
{ print $0 }
#+end_src

#+RESULTS:
| Beth  |  4.0 |  0 |
| Dan   | 3.75 |  0 |
| Kathy |  4.0 | 10 |
| Mark  |  5.0 | 20 |
| Mary  |  5.5 | 22 |
| Susie | 4.25 | 18 |


** Printing Certain Fields

#+begin_src awk :in-file emp.data :exports both
{ print $1, $3 }
#+end_src

#+RESULTS:
| Beth  |  0 |
| Dan   |  0 |
| Kathy | 10 |
| Mark  | 20 |
| Mary  | 22 |
| Susie | 18 |

- Expressions separated by a comma in a print statement are, by
  default, separated by a single blank when they are printed.

** NF, the Number of Fields

- Awk counts the number of fields in the current input line and stores
  the count in a built-in variable called ~NF~.
- Any expression can be used after ~$~ to denote a field number; the
  expression is evaluated and its numberic value is used as the field
  number.

#+begin_src awk :in-file emp.data :exports both
{ print NF, $1, $NF }
#+end_src

#+RESULTS:
| 3 | Beth  |  0 |
| 3 | Dan   |  0 |
| 3 | Kathy | 10 |
| 3 | Mark  | 20 |
| 3 | Mary  | 22 |
| 3 | Susie | 18 |

** Computing and Printing

#+begin_src awk :in-file emp.data :exports both
{ print $1, $2 * $3 }
#+end_src

#+RESULTS:
| Beth  |    0 |
| Dan   |    0 |
| Kathy |   40 |
| Mark  |  100 |
| Mary  |  121 |
| Susie | 76.5 |

** Printing Line Numbers

- Awk provides another built-variable, called *NR*, that counts the
  number of lines read so far.

#+begin_src awk :in-file emp.data :exports both
{ print NR, $0 }
#+end_src

#+RESULTS:
| 1 | Beth  |  4.0 |  0 |
| 2 | Dan   | 3.75 |  0 |
| 3 | Kathy |  4.0 | 10 |
| 4 | Mark  |  5.0 | 20 |
| 5 | Mary  |  5.5 | 22 |
| 6 | Susie | 4.25 | 18 |

** Printing Text in the Output

#+begin_src awk :in-file emp.data :exports both :results value verbatim
{ print "total pay for", $1, "is", $2 * $3 }
#+end_src

#+RESULTS:
: total pay for Beth is 0
: total pay for Dan is 0
: total pay for Kathy is 40
: total pay for Mark is 100
: total pay for Mary is 121
: total pay for Susie is 76.5

* Fancier Output

- The *print* statement is meant for quick and easy output.
- To format the output exactly the way you want it, you may have to
  use the *printf* statement.

** Lining up Fields

#+begin_example
printf(format, value_1, value_2, ... , value_n)
#+end_example

- format: is a string that contains text to be printed verbatim,
  interspered with specifications of how each of the values is to be
  printed.
- A specification is a ~%~ followed by a few characters that control
  the format of a value.
- Thus, there must be as many ~%~ specifications in format as values to
  be printed.

#+begin_src awk :in-file emp.data :exports both :results value verbatim
{ printf("total pay for %s is $%.2f\n", $1, $2 * $3) }
#+end_src

#+RESULTS:
: total pay for Beth is $0.00
: total pay for Dan is $0.00
: total pay for Kathy is $40.00
: total pay for Mark is $100.00
: total pay for Mary is $121.00
: total pay for Susie is $76.50

- ~%s~: Specifices that the first value is a string of characters.
- ~%.2f~: Specifices that the second value (~$2*$3~) is a number with
  2 digits after decimal point.
- ~\n~: Newline

- With printf, no blanks or newlines are produced automatically; you
  must create them yourself.

#+begin_src awk :in-file emp.data :exports both :results value verbatim
{ printf("%-8s $%6.2f\n",$1, $2 * $3)}
#+end_src

#+RESULTS:
: Beth     $  0.00
: Dan      $  0.00
: Kathy    $ 40.00
: Mark     $100.00
: Mary     $121.00
: Susie    $ 76.50

- ~%-8s~ Prints a name as a string of characters left justified in a
  field 8 characters wide.
- ~%6.2f~ prints pay as a number with two digits after the decimal
  point, in a field 6 characters wide.

** Sorting the Output

#+begin_src sh :exports both
awk '{printf("%6.2f %s\n", $2 * $3, $0)}' emp.data | sort
#+end_src

#+RESULTS:
|   0.0 | Beth  |  4.0 |  0 |
|   0.0 | Dan   | 3.75 |  0 |
| 100.0 | Mark  |  5.0 | 20 |
| 121.0 | Mary  |  5.5 | 22 |
|  40.0 | Kathy |  4.0 | 10 |
|  76.5 | Susie | 4.25 | 18 |

