docs/chapter1.html

<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Printing Every line</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">

<pre class="src src-awk">{ print }
</pre>
</div>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="right">

<col  class="right">
</colgroup>
<tbody>
<tr>
<td class="text-left">Beth</td>
<td class="text-right">4.0</td>
<td class="text-right">0</td>
</tr>

<tr>
<td class="text-left">Dan</td>
<td class="text-right">3.75</td>
<td class="text-right">0</td>
</tr>

<tr>
<td class="text-left">Kathy</td>
<td class="text-right">4.0</td>
<td class="text-right">10</td>
</tr>

<tr>
<td class="text-left">Mark</td>
<td class="text-right">5.0</td>
<td class="text-right">20</td>
</tr>

<tr>
<td class="text-left">Mary</td>
<td class="text-right">5.5</td>
<td class="text-right">22</td>
</tr>

<tr>
<td class="text-left">Susie</td>
<td class="text-right">4.25</td>
<td class="text-right">18</td>
</tr>
</tbody>
</table>

<p>
Or even this:
</p>

<div class="org-src-container">

<pre class="src src-awk">{ print $0 }
</pre>
</div>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="right">

<col  class="right">
</colgroup>
<tbody>
<tr>
<td class="text-left">Beth</td>
<td class="text-right">4.0</td>
<td class="text-right">0</td>
</tr>

<tr>
<td class="text-left">Dan</td>
<td class="text-right">3.75</td>
<td class="text-right">0</td>
</tr>

<tr>
<td class="text-left">Kathy</td>
<td class="text-right">4.0</td>
<td class="text-right">10</td>
</tr>

<tr>
<td class="text-left">Mark</td>
<td class="text-right">5.0</td>
<td class="text-right">20</td>
</tr>

<tr>
<td class="text-left">Mary</td>
<td class="text-right">5.5</td>
<td class="text-right">22</td>
</tr>

<tr>
<td class="text-left">Susie</td>
<td class="text-right">4.25</td>
<td class="text-right">18</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Printing Certain Fields</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">

<pre class="src src-awk">{ print $1, $3 }
</pre>
</div>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="right">
</colgroup>
<tbody>
<tr>
<td class="text-left">Beth</td>
<td class="text-right">0</td>
</tr>

<tr>
<td class="text-left">Dan</td>
<td class="text-right">0</td>
</tr>

<tr>
<td class="text-left">Kathy</td>
<td class="text-right">10</td>
</tr>

<tr>
<td class="text-left">Mark</td>
<td class="text-right">20</td>
</tr>

<tr>
<td class="text-left">Mary</td>
<td class="text-right">22</td>
</tr>

<tr>
<td class="text-left">Susie</td>
<td class="text-right">18</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Expressions separated by a comma in a print statement are, by
default, separated by a single blank when they are printed.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> NF, the Number of Fields</h3>
<div class="outline-text-3" id="text-6-3">
<ul class="org-ul">
<li>Awk counts the number of fields in the current input line and stores
the count in a built-in variable called <code>NF</code>.
</li>
<li>Any expression can be used after <code>$</code> to denote a field number; the
expression is evaluated and its numberic value is used as the field
number.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-awk">{ print NF, $1, $NF }
</pre>
</div>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="right">

<col  class="left">

<col  class="right">
</colgroup>
<tbody>
<tr>
<td class="text-right">3</td>
<td class="text-left">Beth</td>
<td class="text-right">0</td>
</tr>

<tr>
<td class="text-right">3</td>
<td class="text-left">Dan</td>
<td class="text-right">0</td>
</tr>

<tr>
<td class="text-right">3</td>
<td class="text-left">Kathy</td>
<td class="text-right">10</td>
</tr>

<tr>
<td class="text-right">3</td>
<td class="text-left">Mark</td>
<td class="text-right">20</td>
</tr>

<tr>
<td class="text-right">3</td>
<td class="text-left">Mary</td>
<td class="text-right">22</td>
</tr>

<tr>
<td class="text-right">3</td>
<td class="text-left">Susie</td>
<td class="text-right">18</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> Computing and Printing</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">

<pre class="src src-awk">{ print $1, $2 * $3 }
</pre>
</div>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="right">
</colgroup>
<tbody>
<tr>
<td class="text-left">Beth</td>
<td class="text-right">0</td>
</tr>

<tr>
<td class="text-left">Dan</td>
<td class="text-right">0</td>
</tr>

<tr>
<td class="text-left">Kathy</td>
<td class="text-right">40</td>
</tr>

<tr>
<td class="text-left">Mark</td>
<td class="text-right">100</td>
</tr>

<tr>
<td class="text-left">Mary</td>
<td class="text-right">121</td>
</tr>

<tr>
<td class="text-left">Susie</td>
<td class="text-right">76.5</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> Printing Line Numbers</h3>
<div class="outline-text-3" id="text-6-5">
<ul class="org-ul">
<li>Awk provides another built-variable, called <b>NR</b>, that counts the
number of lines read so far.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-awk">{ print NR, $0 }
</pre>
</div>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="right">

<col  class="left">

<col  class="right">

<col  class="right">
</colgroup>
<tbody>
<tr>
<td class="text-right">1</td>
<td class="text-left">Beth</td>
<td class="text-right">4.0</td>
<td class="text-right">0</td>
</tr>

<tr>
<td class="text-right">2</td>
<td class="text-left">Dan</td>
<td class="text-right">3.75</td>
<td class="text-right">0</td>
</tr>

<tr>
<td class="text-right">3</td>
<td class="text-left">Kathy</td>
<td class="text-right">4.0</td>
<td class="text-right">10</td>
</tr>

<tr>
<td class="text-right">4</td>
<td class="text-left">Mark</td>
<td class="text-right">5.0</td>
<td class="text-right">20</td>
</tr>

<tr>
<td class="text-right">5</td>
<td class="text-left">Mary</td>
<td class="text-right">5.5</td>
<td class="text-right">22</td>
</tr>

<tr>
<td class="text-right">6</td>
<td class="text-left">Susie</td>
<td class="text-right">4.25</td>
<td class="text-right">18</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> Printing Text in the Output</h3>
<div class="outline-text-3" id="text-6-6">
<div class="org-src-container">

<pre class="src src-awk">{ print "total pay for", $1, "is", $2 * $3 }
</pre>
</div>

<pre class="example">
total pay for Beth is 0
total pay for Dan is 0
total pay for Kathy is 40
total pay for Mark is 100
total pay for Mary is 121
total pay for Susie is 76.5
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Fancier Output</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>The <b>print</b> statement is meant for quick and easy output.
</li>
<li>To format the output exactly the way you want it, you may have to
use the <b>printf</b> statement.
</li>
</ul>
</div>

<div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Lining up Fields</h3>
<div class="outline-text-3" id="text-7-1">
<pre class="example">
printf(format, value_1, value_2, ... , value_n)
</pre>

<ul class="org-ul">
<li>format: is a string that contains text to be printed verbatim,
interspered with specifications of how each of the values is to be
printed.
</li>
<li>A specification is a <code>%</code> followed by a few characters that control
the format of a value.
</li>
<li>Thus, there must be as many <code>%</code> specifications in format as values to
be printed.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-awk">{ printf("total pay for %s is $%.2f\n", $1, $2 * $3) }
</pre>
</div>

<pre class="example">
total pay for Beth is $0.00
total pay for Dan is $0.00
total pay for Kathy is $40.00
total pay for Mark is $100.00
total pay for Mary is $121.00
total pay for Susie is $76.50
</pre>


<ul class="org-ul">
<li><code>%s</code>: Specifices that the first value is a string of characters.
</li>
<li><code>%.2f</code>: Specifices that the second value (<code>$2*$3</code>) is a number with
2 digits after decimal point.
</li>
<li><code>\n</code>: Newline
</li>

<li>With printf, no blanks or newlines are produced automatically; you
must create them yourself.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-awk">{ printf("%-8s $%6.2f\n",$1, $2 * $3)}
</pre>
</div>

<pre class="example">
Beth     $  0.00
Dan      $  0.00
Kathy    $ 40.00
Mark     $100.00
Mary     $121.00
Susie    $ 76.50
</pre>


<ul class="org-ul">
<li><code>%-8s</code> Prints a name as a string of characters left justified in a
field 8 characters wide.
</li>
<li><code>%6.2f</code> prints pay as a number with two digits after the decimal
point, in a field 6 characters wide.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> Sorting the Output</h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">

<pre class="src src-sh">awk '{printf("%6.2f %s\n", $2 * $3, $0)}' emp.data | sort
</pre>
</div>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="right">

<col  class="left">

<col  class="right">

<col  class="right">
</colgroup>
<tbody>
<tr>
<td class="text-right">0.0</td>
<td class="text-left">Beth</td>
<td class="text-right">4.0</td>
<td class="text-right">0</td>
</tr>

<tr>
<td class="text-right">0.0</td>
<td class="text-left">Dan</td>
<td class="text-right">3.75</td>
<td class="text-right">0</td>
</tr>

<tr>
<td class="text-right">100.0</td>
<td class="text-left">Mark</td>
<td class="text-right">5.0</td>
<td class="text-right">20</td>
</tr>

<tr>
<td class="text-right">121.0</td>
<td class="text-left">Mary</td>
<td class="text-right">5.5</td>
<td class="text-right">22</td>
</tr>

<tr>
<td class="text-right">40.0</td>
<td class="text-left">Kathy</td>
<td class="text-right">4.0</td>
<td class="text-right">10</td>
</tr>

<tr>
<td class="text-right">76.5</td>
<td class="text-left">Susie</td>
<td class="text-right">4.25</td>
<td class="text-right">18</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
