chapter1.org
* Selection

- Awk patterns are good for selecting interesting lines from the input
  for further processing.
- Since a pattern without an action prints all lines matching the
  pattern, many awk programs consist of nothing more than a single
  pattern.


** Selection by Comparison

- Employees who earn more than or equal to $5 per hour:

#+begin_src awk :in-file emp.data :exports both
$2 >= 5
#+end_src

#+RESULTS:
| Mark | 5.0 | 20 |
| Mary | 5.5 | 22 |

** Selection by Computation

- Employees whose total pay exceeds $50

#+begin_src awk :in-file emp.data :exports both :results value verbatim
$2 * $3 > 50 { printf("$%.2f for %s\n", $2 * $3, $1)}
#+end_src

#+RESULTS:
: $100.00 for Mark
: $121.00 for Mary
: $76.50 for Susie

** Selection by Text Content

#+begin_src awk :in-file emp.data :exports both
$1 == "Susie"
#+end_src

#+RESULTS:
: Susie 4.25   18

- The text pattern can also be regular expressions

** Combinations of Patterns

- Logical operators can be used: ~&&, ||~ and ~!~

#+begin_src awk :in-file emp.data :exports both
$2 >= 4
$3 >= 20
#+end_src

#+RESULTS:
| Beth  |  4.0 |  0 |
| Kathy |  4.0 | 10 |
| Mark  |  5.0 | 20 |
| Mark  |  5.0 | 20 |
| Mary  |  5.5 | 22 |
| Mary  |  5.5 | 22 |
| Susie | 4.25 | 18 |

#+begin_src awk :in-file emp.data :exports both
!($2 < 4 && $3 < 20)
#+end_src

#+RESULTS:
| Beth  |  4.0 |  0 |
| Kathy |  4.0 | 10 |
| Mark  |  5.0 | 20 |
| Mary  |  5.5 | 22 |
| Susie | 4.25 | 18 |

** Data validation

- Awk is an excellent tool for checking that data has reasonable
  values and is in the right format, a task that is often called data
  validation.
- Data validation is essentially negative: instead of printing lines
  with desirable properties, one prints lines that are suspicious.

#+begin_src awk :in-file emp.data :exports both
NF != 3 { print $0, "number of files is not equal to 3"}
#+end_src

#+RESULTS:

If there are no errors, there's no output.

#+begin_src awk :in-file emp.data :exports both
$2 > 10 { print $0, "rate exceeds $10 per hour"}
#+end_src

** BEGIN and END

- The special pattern *BEGIN* matches before the first line of the first
  input ·file is read, and *END* matches after the last line of the last
  file has been processed.

#+begin_src awk :in-file emp.data :exports both :results value verbatim
BEGIN { print "NAME  RATE   HOURS"; print ""}
      { print }
#+end_src

#+RESULTS:
: NAME  RATE   HOURS
: 
: Beth  4.00   0
: Dan   3.75   0
: Kathy 4.00   10
: Mark  5.00   20
: Mary  5.50   22
: Susie 4.25   18

* Computing with AWK

- An action is a sequence of statements separated by newlines or
  semicolons.
- In awk, user-created variables are not declared.

#+begin_src awk :in-file emp.data :exports both :results value verbatim
$3 > 15 { emp = emp + 1}
END     { print emp, "employees worked more than 15 hours" }
#+end_src

#+RESULTS:
: 3 employees worked more than 15 hours

- Awk variables used as numbers begin life with the value of *0*, so
  we didn't need to initialize ~emp~ above.

** Computing Sums and Averages

- Computing number of employees

#+begin_src awk :in-file emp.data :exports both :results value verbatim
END { print NR, "employees" }
#+end_src

#+RESULTS:
: 6 employees

- Compute average pay

#+begin_src awk :in-file emp.data :exports both :results value verbatim
    { pay = pay + $2 * $3 }
END { print NR, "employees" 
      print "total pay is", pay
      print "average pay is", pay/NR
    }
#+end_src

#+RESULTS:
: 6 employees
: total pay is 337.5
: average pay is 56.25

** Handling Text

- Awk variables can hold strings of characters.
- Variables used to store strings begin life holding the null string.

#+begin_src awk :in-file emp.data :exports both :results value verbatim
$2 > maxrate { maxrate = $2; maxemp = $1 }
END { print "highest hourly rate:", maxrate, "for", maxemp }
#+end_src

#+RESULTS:
: highest hourly rate: 5.50 for Mary

- In the above awk code, the variable ~maxemp~ holds a string.

** String Concatenation

- Combine all the employee names into a single string:

#+begin_src awk :in-file emp.data :exports both :results value verbatim
    { names = names $1 " " }
END { print names }
#+end_src

#+RESULTS:
: Beth Dan Kathy Mark Mary Susie 

** Printing the Last Input Line

#+begin_src awk :in-file emp.data :exports both :results value verbatim
    { last = $0 }
END { print last }
#+end_src

#+RESULTS:
: Susie 4.25   18

** Built-in functions

- Arithematic functions for square roots, logarithms, random numbers etc.
- ~length~: Counts the number of characters in a string

#+begin_src awk :in-file emp.data :exports both :results value verbatim
{ print $1, length($1) }
#+end_src

#+RESULTS:
: Beth 4
: Dan 3
: Kathy 5
: Mark 4
: Mary 4
: Susie 5

** Counting Lines, Words and Characters

- In the below program, for convenience we will treat each field as
  word.

#+begin_src awk :in-file emp.data :exports both :results value verbatim
    { nc = nc + length($0) + 1 } # 1 for newline
    { nw = nw + NF }
END { print NR, "lines", nw, "words", nc, "characters" }
#+end_src

#+RESULTS:
: 6 lines 18 words 94 characters

* Control-Flow Statements

