docs/chapter1.html

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Selection</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>Awk patterns are good for selecting interesting lines from the input
for further processing.
</li>
<li>Since a pattern without an action prints all lines matching the
pattern, many awk programs consist of nothing more than a single
pattern.
</li>
</ul>
</div>


<div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> Selection by Comparison</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li>Employees who earn more than or equal to $5 per hour:
</li>
</ul>

<div class="org-src-container">

<pre class="src src-awk">$2 &gt;= 5
</pre>
</div>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="right">

<col  class="right">
</colgroup>
<tbody>
<tr>
<td class="text-left">Mark</td>
<td class="text-right">5.0</td>
<td class="text-right">20</td>
</tr>

<tr>
<td class="text-left">Mary</td>
<td class="text-right">5.5</td>
<td class="text-right">22</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> Selection by Computation</h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li>Employees whose total pay exceeds $50
</li>
</ul>

<div class="org-src-container">

<pre class="src src-awk">$2 * $3 &gt; 50 { printf("$%.2f for %s\n", $2 * $3, $1)}
</pre>
</div>

<pre class="example">
$100.00 for Mark
$121.00 for Mary
$76.50 for Susie
</pre>
</div>
</div>

<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> Selection by Text Content</h3>
<div class="outline-text-3" id="text-8-3">
<div class="org-src-container">

<pre class="src src-awk">$1 == "Susie"
</pre>
</div>

<pre class="example">
Susie 4.25   18
</pre>


<ul class="org-ul">
<li>The text pattern can also be regular expressions
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8-4" class="outline-3">
<h3 id="sec-8-4"><span class="section-number-3">8.4</span> Combinations of Patterns</h3>
<div class="outline-text-3" id="text-8-4">
<ul class="org-ul">
<li>Logical operators can be used: <code>&amp;&amp;, ||</code> and <code>!</code>
</li>
</ul>

<div class="org-src-container">

<pre class="src src-awk">$2 &gt;= 4
$3 &gt;= 20
</pre>
</div>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="right">

<col  class="right">
</colgroup>
<tbody>
<tr>
<td class="text-left">Beth</td>
<td class="text-right">4.0</td>
<td class="text-right">0</td>
</tr>

<tr>
<td class="text-left">Kathy</td>
<td class="text-right">4.0</td>
<td class="text-right">10</td>
</tr>

<tr>
<td class="text-left">Mark</td>
<td class="text-right">5.0</td>
<td class="text-right">20</td>
</tr>

<tr>
<td class="text-left">Mark</td>
<td class="text-right">5.0</td>
<td class="text-right">20</td>
</tr>

<tr>
<td class="text-left">Mary</td>
<td class="text-right">5.5</td>
<td class="text-right">22</td>
</tr>

<tr>
<td class="text-left">Mary</td>
<td class="text-right">5.5</td>
<td class="text-right">22</td>
</tr>

<tr>
<td class="text-left">Susie</td>
<td class="text-right">4.25</td>
<td class="text-right">18</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-awk">!($2 &lt; 4 &amp;&amp; $3 &lt; 20)
</pre>
</div>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="right">

<col  class="right">
</colgroup>
<tbody>
<tr>
<td class="text-left">Beth</td>
<td class="text-right">4.0</td>
<td class="text-right">0</td>
</tr>

<tr>
<td class="text-left">Kathy</td>
<td class="text-right">4.0</td>
<td class="text-right">10</td>
</tr>

<tr>
<td class="text-left">Mark</td>
<td class="text-right">5.0</td>
<td class="text-right">20</td>
</tr>

<tr>
<td class="text-left">Mary</td>
<td class="text-right">5.5</td>
<td class="text-right">22</td>
</tr>

<tr>
<td class="text-left">Susie</td>
<td class="text-right">4.25</td>
<td class="text-right">18</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-8-5" class="outline-3">
<h3 id="sec-8-5"><span class="section-number-3">8.5</span> Data validation</h3>
<div class="outline-text-3" id="text-8-5">
<ul class="org-ul">
<li>Awk is an excellent tool for checking that data has reasonable
values and is in the right format, a task that is often called data
validation.
</li>
<li>Data validation is essentially negative: instead of printing lines
with desirable properties, one prints lines that are suspicious.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-awk">NF != 3 { print $0, "number of files is not equal to 3"}
</pre>
</div>

<p>
If there are no errors, there's no output.
</p>

<div class="org-src-container">

<pre class="src src-awk">$2 &gt; 10 { print $0, "rate exceeds $10 per hour"}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-8-6" class="outline-3">
<h3 id="sec-8-6"><span class="section-number-3">8.6</span> BEGIN and END</h3>
<div class="outline-text-3" id="text-8-6">
<ul class="org-ul">
<li>The special pattern <b>BEGIN</b> matches before the first line of the first
input ·file is read, and <b>END</b> matches after the last line of the last
file has been processed.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-awk">BEGIN { print "NAME  RATE   HOURS"; print ""}
      { print }
</pre>
</div>

<pre class="example">
NAME  RATE   HOURS

Beth  4.00   0
Dan   3.75   0
Kathy 4.00   10
Mark  5.00   20
Mary  5.50   22
Susie 4.25   18
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Computing with AWK</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>An action is a sequence of statements separated by newlines or
semicolons.
</li>
<li>In awk, user-created variables are not declared.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-awk">$3 &gt; 15 { emp = emp + 1}
END     { print emp, "employees worked more than 15 hours" }
</pre>
</div>

<pre class="example">
3 employees worked more than 15 hours
</pre>


<ul class="org-ul">
<li>Awk variables used as numbers begin life with the value of <b>0</b>, so
we didn't need to initialize <code>emp</code> above.
</li>
</ul>
</div>

<div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> Computing Sums and Averages</h3>
<div class="outline-text-3" id="text-9-1">
<ul class="org-ul">
<li>Computing number of employees
</li>
</ul>

<div class="org-src-container">

<pre class="src src-awk">END { print NR, "employees" }
</pre>
</div>

<pre class="example">
6 employees
</pre>


<ul class="org-ul">
<li>Compute average pay
</li>
</ul>

<div class="org-src-container">

<pre class="src src-awk">    { pay = pay + $2 * $3 }
END { print NR, "employees" 
      print "total pay is", pay
      print "average pay is", pay/NR
    }
</pre>
</div>

<pre class="example">
6 employees
total pay is 337.5
average pay is 56.25
</pre>
</div>
</div>

<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> Handling Text</h3>
<div class="outline-text-3" id="text-9-2">
<ul class="org-ul">
<li>Awk variables can hold strings of characters.
</li>
<li>Variables used to store strings begin life holding the null string.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-awk">$2 &gt; maxrate { maxrate = $2; maxemp = $1 }
END { print "highest hourly rate:", maxrate, "for", maxemp }
</pre>
</div>

<pre class="example">
highest hourly rate: 5.50 for Mary
</pre>


<ul class="org-ul">
<li>In the above awk code, the variable <code>maxemp</code> holds a string.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="section-number-3">9.3</span> String Concatenation</h3>
<div class="outline-text-3" id="text-9-3">
<ul class="org-ul">
<li>Combine all the employee names into a single string:
</li>
</ul>

<div class="org-src-container">

<pre class="src src-awk">    { names = names $1 " " }
END { print names }
</pre>
</div>

<pre class="example">
Beth Dan Kathy Mark Mary Susie
</pre>
</div>
</div>

<div id="outline-container-sec-9-4" class="outline-3">
<h3 id="sec-9-4"><span class="section-number-3">9.4</span> Printing the Last Input Line</h3>
<div class="outline-text-3" id="text-9-4">
<div class="org-src-container">

<pre class="src src-awk">    { last = $0 }
END { print last }
</pre>
</div>

<pre class="example">
Susie 4.25   18
</pre>
</div>
</div>

<div id="outline-container-sec-9-5" class="outline-3">
<h3 id="sec-9-5"><span class="section-number-3">9.5</span> Built-in functions</h3>
<div class="outline-text-3" id="text-9-5">
<ul class="org-ul">
<li>Arithematic functions for square roots, logarithms, random numbers etc.
</li>
<li><code>length</code>: Counts the number of characters in a string
</li>
</ul>

<div class="org-src-container">

<pre class="src src-awk">{ print $1, length($1) }
</pre>
</div>

<pre class="example">
Beth 4
Dan 3
Kathy 5
Mark 4
Mary 4
Susie 5
</pre>
</div>
</div>

<div id="outline-container-sec-9-6" class="outline-3">
<h3 id="sec-9-6"><span class="section-number-3">9.6</span> Counting Lines, Words and Characters</h3>
<div class="outline-text-3" id="text-9-6">
<ul class="org-ul">
<li>In the below program, for convenience we will treat each field as
word.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-awk">    { nc = nc + length($0) + 1 } # 1 for newline
    { nw = nw + NF }
END { print NR, "lines", nw, "words", nc, "characters" }
</pre>
</div>

<pre class="example">
6 lines 18 words 94 characters
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Control-Flow Statements</h2>
