chapter1.org
** If-Else Statement

- Compute total and average pay of employees making more than $6 per
  hour.

#+begin_src awk :in-file emp.data :exports both :results value verbatim
$2 > 6 { n = n + 1; pay = pay + $2 * $3 }
END    { if (n > 0)
             print n, "employees total pay is", pay, "average pay is", pay/n
         else
             print "no employees are paid more than $6/hour"
       }
#+end_src

#+RESULTS:
: no employees are paid more than $6/hour

** While Statement

#+begin_src awk
  { i = 1
    while (i <= $3) {
      printf("\t%.2f\n", $1 * (1 + $2) ^ i)
      i = i + 1
    }
  }
#+end_src

** For Statement

#+begin_src 
{ for(i = 1; i <= $3 ; i = i + 1)
     printf("\t%.2f\n", $1 * (1 + $2) ^ i)
}
#+end_src

* Arrays

- Arrays are used for storing groups of related values.
- Program to reverse each line

#+begin_src awk :in-file emp.data :exports both :results value verbatim
      { line[NR] = $0 }               # remember each input line
  END { i = NR
        while (i > 0) {
          print line[i]
          i = i - 1
        }
  }
#+end_src

#+RESULTS:
: Susie 4.25   18
: Mary  5.50   22
: Mark  5.00   20
: Kathy 4.00   10
: Dan   3.75   0
: Beth  4.00   0

Same example with a for statement:

#+begin_src awk :in-file emp.data :exports both :results value verbatim
      { line[NR] = $0 }
  END { for(i = NR; i > 0; i = i - 1)
             print line[i]
      }
#+end_src

#+RESULTS:
: Susie 4.25   18
: Mary  5.50   22
: Mark  5.00   20
: Kathy 4.00   10
: Dan   3.75   0
: Beth  4.00   0


* A Handful of Useful "One-liners"

- Print total number of input lines

#+begin_src awk :in-file emp.data :exports both :results value verbatim
END { print NR }
#+end_src

#+RESULTS:
: 6

- Print the third input line

#+begin_src awk :in-file emp.data :exports both :results value verbatim
NR == 3
#+end_src

#+RESULTS:
: Kathy 4.00   10
